#### LineSegment Members

---

|  |
| --- |
| LineSegment Class   Methods   Properties   See Also |

The  LineSegment  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  LineSegment |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | EndParameter | Parameter associated with the end point. |
| Public property | EndPoint | End point of the line segment. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | LineProperties | Access to the line (pen) properties of the line |
| Public property | StartParameter | Parameter associated with the start point. |
| Public property | StartPoint | Start point of the line segment. |

# See Also

LineSegment Class

Autodesk.Revit.DB Namespace